Revit 2026 API

# TableCellStyleOverrideOptions Class

---

This helper class represents the overridden characteristics of the associated cell.

SystemObject Autodesk.Revit.DBTableCellStyleOverrideOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TableCellStyleOverrideOptions : IDisposable
```
```vb
Public Class TableCellStyleOverrideOptions
	Implements IDisposable
```
```cpp
public ref class TableCellStyleOverrideOptions : IDisposable
```
```fsharp
type TableCellStyleOverrideOptions =
    class
        interface IDisposable
    end
```

The TableCellStyleOverrideOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TableCellStyleOverrideOptions | Creates a new instance with no style characteristics overridden. |
|  | TableCellStyleOverrideOptions(TableCellStyleOverrideOptions) | Creates a new instance by copying an existing instance. |

|  | Name | Description |
| --- | --- | --- |
|  | BackgroundColor | Indicates if the background color characteristic is overridden. |
|  | Bold | Indicates if the bold characteristic is overridden. |
|  | BorderBottomLineStyle | Indicates if the border bottom line style characteristic is overridden. |
|  | BorderLeftLineStyle | Indicates if the border left line style characteristic is overridden. |
|  | BorderLineStyle | Indicates if the border line style characteristic is overridden. |
|  | BorderRightLineStyle | Indicates if the border right line style characteristic is overridden. |
|  | BorderTopLineStyle | Indicates if the border top line style characteristic is overridden. |
|  | Font | Indicates if the font name characteristic is overridden. |
|  | FontColor | Indicates if the font color characteristic is overridden. |
|  | FontSize | Indicates if the font size characteristic is overridden. |
|  | HorizontalAlignment | Indicates if the horizontal alignment characteristic is overridden. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Italics | Indicates if the italics characteristic is overridden. |
|  | TextOrientation | Indicates if the text orientation characteristic is overridden. |
|  | Underline | Indicates if the underline characteristic is overridden. |
|  | VerticalAlignment | Indicates if the vertical alignment characteristic is overridden. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TableCellStyleOverrideOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetAllOverrides | Sets all overrides to a specific value. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The user can override the text appearance and cell graphic properties by setting the corresponding flag to true. The global base format will control the non-overridden characteristics.

#### Reference

Autodesk.Revit.DB Namespace